Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/court_of_criminal_appeal.html.txt.tmx
Source language: en
Languages: ga

source: Court of Criminal Appeal
ga: An Chúirt Achomharc Choiriúil

source: Under the Court of Appeal Act 2014, the Court of Criminal Appeal was abolished
ga: Faoi na Cúirte Acht um Achomhairc 2014, tá an Chúirt Achomhairc Choiriúil a dhíothú

source: Appeals arising since 28 October 2014 are heard by the new Court of Appeal
ga: Achomhairc a eascraíonn ó 28 Deireadh Fómhair, 2014 éisteann an Chúirt Achomhairc nua

source: In an appeal against conviction, the Court of Criminal Appeal could: 1. dismiss the appeal or, 2. quash the conviction and release the defendant or, 3
ga: Bhí an Chúirt Achomhairc Choiriúil comhdhéanta de Bhreitheamh den Chúirt Uachtarach agus beirt Bhreithiúna na hArd-Chúirte

source: 4. quash the conviction and, if the person appealing their conviction or sentence is considered to be guilty of some other offence, substitute a verdict and impose a sentence which is not more severe than the original one
ga: Éistearan le hachomhairc ann i gcoinne ciontaithe nó pianbhreithe ón gCúirt Choiriúil Chuarda, ón bPríomhchúirt Choiriúil agus ón gCúirt Choiriúil Speisialta agus déantar achomhairc ann i gcoinne trócaire phianbhreithe tríd an Stiúrthóir Ionchúiseamh Poiblí amháin
